{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4, 81, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 15]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 17]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}], ["activation_2", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "global_average_pooling2d_1"}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "fc1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["fc1", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}